#include <math.h>
#include <stdio.h>

double Integral (double (*f)(double), double from, double to, double step) {
// f - интегрируемая функция, можно вызвать например y = f(x)
// from и to - пределы интегрирования
// step - шаг
    
    double sum = 0;
    double i; // фактически - координата x, объявляем здесь, чтобы сохранить переменную после цикла
    for (i = from; i <= to - step; i += step) {
        sum += ((f(i) + f(i + step)) / 2) * step;
    }
    sum += ((f(to) + f(i)) / 2) * (to - i);
    
    /* Шаг интегрирования прибавляется после вычисления площади трапеции, то есть
    площадь мы считаем впереди от текущего i (i = 0, площадь до 0.0001)
    и в конце можем вылезти за пределы to (на примере sin от 0 до 3.14159:
    достигаем i = 3.1415 а площадь считается до 3.1416 > 3.14159).
    
    Другоми словами в конце вычисления может остаться остаток меньше шага,
    на примере Integral(sin, 0, 3.14159, 0.0001) это 0.00009,
    и если мы будем считать его как полноценную трапецию с высотой равной шагу,
    получим лишнюю погрешность в сторону увеличения результата.
    Для того, чтобы это предотвратить, сделаем на шаг меньше, а потом досчитаем
    оставшийся промежуток с конца. Отсюда i <= to - step. 
    (to - from) - (int)(to - from) - остаток в конце, высота последней, маленькой трапеции */

    return sum;
}

double function(double x) {
    // любая функция
    return pow(sin(x), 2) + pow(cos(x), 2);
}

int main() {
    double res;

    res = Integral(function, 0, 10, 0.0001);
    printf("Result: %lf\n", res);
    return 0;
}
